apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_dmamux.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/rt118x/imxrt118x_dmamux.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_DMAMUX_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_DMAMUX_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <stdint.h>

#include "hardware/imxrt_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* eDMA3/eDMA4 request source constants (IMXRT1180RM Ch. 5) */

#define IMXRT_DMA_ENGINE_EDMA3       (0)
#define IMXRT_DMA_ENGINE_EDMA4       (1)

#define IMXRT_DMA_SRC_ENGINE_SHIFT   (8)
#define IMXRT_DMA_SRC_ENGINE_MASK    (0xff << IMXRT_DMA_SRC_ENGINE_SHIFT)
#define IMXRT_DMA_SRC_MUX_SHIFT      (0)
#define IMXRT_DMA_SRC_MUX_MASK       (0xff << IMXRT_DMA_SRC_MUX_SHIFT)
#define EDMA_MUX_MASK                IMXRT_DMA_SRC_MUX_MASK

#define IMXRT_DMA_SRC(_engine, _mux) \
  (((_engine) << IMXRT_DMA_SRC_ENGINE_SHIFT) | \
   ((_mux) << IMXRT_DMA_SRC_MUX_SHIFT))

#define IMXRT_DMA_SRC_ENGINE(_v) \
  (((_v) & IMXRT_DMA_SRC_ENGINE_MASK) >> IMXRT_DMA_SRC_ENGINE_SHIFT)
#define IMXRT_DMA_SRC_MUX(_v) \
  (((_v) & IMXRT_DMA_SRC_MUX_MASK) >> IMXRT_DMA_SRC_MUX_SHIFT)

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

#ifndef __ASSEMBLY__

static inline uintptr_t imxrt_dmamux_get_dmabase(uint16_t dmamux)
{
  return (IMXRT_DMA_SRC_ENGINE(dmamux) == IMXRT_DMA_ENGINE_EDMA3) ?
         IMXRT_DMA3_BASE : IMXRT_DMA4_BASE;
}

#endif /* __ASSEMBLY__ */

/* eDMA3 (AONMIX) request sources */

#define IMXRT_DMACHAN_CAN1                            IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 1)
#define IMXRT_DMACHAN_GPIO1_REQUEST0                  IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 3)
#define IMXRT_DMACHAN_GPIO1_REQUEST1                  IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 4)
#define IMXRT_DMACHAN_I3_C1_TO_BUS_REQUEST            IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 5)
#define IMXRT_DMACHAN_I3_C1_FROM_BUS_REQUEST          IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 6)
#define IMXRT_DMACHAN_LPI2_C1_TX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 7)
#define IMXRT_DMACHAN_LPI2_C1_RX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 8)
#define IMXRT_DMACHAN_LPI2_C2_TX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 9)
#define IMXRT_DMACHAN_LPI2_C2_RX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 10)
#define IMXRT_DMACHAN_LPSPI1_TX                       IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 11)
#define IMXRT_DMACHAN_LPSPI1_RX                       IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 12)
#define IMXRT_DMACHAN_LPSPI2_TX                       IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 13)
#define IMXRT_DMACHAN_LPSPI2_RX                       IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 14)
#define IMXRT_DMACHAN_LPTMR1_REQUEST                  IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 15)
#define IMXRT_DMACHAN_LPUART1_TX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 16)
#define IMXRT_DMACHAN_LPUART1_RX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 17)
#define IMXRT_DMACHAN_LPUART2_TX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 18)
#define IMXRT_DMACHAN_LPUART2_RX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 19)
#define IMXRT_DMACHAN_EDGELOCK_REQUEST                IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 20)
#define IMXRT_DMACHAN_SAI1_TX                         IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 21)
#define IMXRT_DMACHAN_SAI1_RX                         IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 22)
#define IMXRT_DMACHAN_TPM1_REQUEST0_REQUEST2          IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 23)
#define IMXRT_DMACHAN_TPM1_REQUEST1_REQUEST3          IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 24)
#define IMXRT_DMACHAN_TPM1_OVERFLOW_REQUEST           IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 25)
#define IMXRT_DMACHAN_TPM2_REQUEST0_REQUEST2          IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 26)
#define IMXRT_DMACHAN_TPM2_REQUEST1_REQUEST3          IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 27)
#define IMXRT_DMACHAN_TPM2_OVERFLOW_REQUEST           IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 28)
#define IMXRT_DMACHAN_LPUART7_TX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 29)
#define IMXRT_DMACHAN_LPUART7_RX                      IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 30)
#define IMXRT_DMACHAN_FLEX_SPI2_TX                    IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 33)
#define IMXRT_DMACHAN_FLEX_SPI2_RX                    IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 34)
#define IMXRT_DMACHAN_CAN3                            IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 38)
#define IMXRT_DMACHAN_LPUART12_TX                     IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 31)
#define IMXRT_DMACHAN_LPUART12_RX                     IMXRT_DMA_SRC(IMXRT_DMA_ENGINE_EDMA3, 32)

/* eDMA4 (WAKEUPMIX / MEGAMIX) request sources */

